app/views/tasks/_completed_on.html.erb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
<% def completed_on %>
  <% @task = Task.find(params[:id]) %>