app/controllers/tasks_controller.rb

    task = Task.create task_params
---
INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "create a controller action for the task `index` page which contains an array of hard-coded tasks"], ["created_at", 2017-03-22 19:50:56 UTC], ["updated_at", 2017-03-22 19:50:56 UTC]]

    task = Task.find(params[:id])

    if task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "name" = ?, "description" = ?, "complete" = ?, "completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", nil], ["name", nil], ["description", nil], ["complete", true], ["completion_date", "2017-03-25 12:59:32 -0700"], ["updated_at", 2017-03-25 19:59:32 UTC], ["id", 25]]

    task = Task.find(params[:id])

    if task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = ?, "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completion_date", ""], ["complete", false], ["updated_at", 2017-03-27 03:01:39 UTC], ["id", 27]]

  def destroy
    Task.destroy(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 14]]